src_doc/InformationRegisters/УчастникиМероприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчастникиМероприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отсутствовал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеПриглашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПриглашения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвкаОбязательна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСуммаПриглашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеАдресаты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Enums/СобытияУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СобытияУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвтозаполнениеМоихФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеМоейЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументАннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакончилсяСрокДействияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятияИзменениеПриглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятияОтклоненоПриглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятияОтменаПриглашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятияПриглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятияПринятоПриглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминаниеОЗамереТемпературы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУказанИсполнительПроектнойЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменПоЭДОВыполненУспешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкиНаПаузе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСПоложительнымРезультатомДействияОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеСПоложительнымРезультатомПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеДокументаКонтрагентомПоЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствуетАвансовыйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствуетОригинал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОЗамерахТемпературы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеренаправлениеМоейЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодошелСрокДействияДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодошелСрокЗаявкиНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодошелСрокКонтрольнойТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодошелСрокКонтроля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоявлениеЗамераСПовышеннойТемпературой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПросроченаЗадачаАвтора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПросроченаКонтрольнаяТочка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПросроченаОценкаКонтрольнойТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПросроченКонтроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводкаОРабочемВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводкаПоЗадачам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеТемыФорума</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаймлистПолучениеРасшифровкиАвтопротокола</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяАннулированиеДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеПрограммы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПодошелСрокЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПросроченаЗадача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСозданиеЗаписиКалендаря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДОДокументАннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДОДокументИсправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДОДокументОтклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДОТребуетсяПодтверждениеАннулирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_doc/Catalogs/ЗамещающиеИПомощники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗамещающиеИПомощники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЗамещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗамещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замещающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Отсутствие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыЗамещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Область</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбластиЗамещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтбора</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеОтбораОбластиЗамещения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/InformationRegisters/УчастникиМероприятия/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает доступные текущему пользователю приглашения.
//
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия - Мероприятие.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Доступные приглашения.
//
Функция ДоступныеПриглашения(Мероприятие) Экспорт
	
	ДоступныеПриглашения = Новый ТаблицаЗначений;
	ДоступныеПриглашения.Колонки.Добавить("Исполнитель");
	ДоступныеПриглашения.Колонки.Добавить("ОтКогоДелегирование");
	ДоступныеПриглашения.Колонки.Добавить("Представление");
	ДоступныеПриглашения.Колонки.Добавить("СостояниеПриглашения");
	Если Не ЗначениеЗаполнено(Мероприятие) Тогда
		Возврат ДоступныеПриглашения;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УчастникиМероприятия.Исполнитель КАК Исполнитель,
		|	ВЫБОР
		|		КОГДА УчастникиМероприятия.Исполнитель ССЫЛКА Справочник.ПолныеРоли
		|			ТОГДА ЕСТЬNULL(ЗамещающиеИПомощники.Сотрудник, ИсполнителиРолейИДелегаты.ИсполнительДелегат)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	КОНЕЦ КАК ОтКогоДелегирование,
		|	УчастникиМероприятия.СостояниеПриглашения КАК СостояниеПриглашения
		|ИЗ
		|	РегистрСведений.УчастникиМероприятия КАК УчастникиМероприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиРолейИДелегаты КАК ИсполнителиРолейИДелегаты
		|		ПО УчастникиМероприятия.Исполнитель = ИсполнителиРолейИДелегаты.РольСотрудник
		|		И ИсполнителиРолейИДелегаты.ИсполнительДелегат В (&СотрудникиПользователя)
		|		И ИсполнителиРолейИДелегаты.ИмяОбластиДелегирования В ("""", ""Мероприятия"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗамещающиеИПомощники КАК ЗамещающиеИПомощники
		|		ПО ИсполнителиРолейИДелегаты.НастройкаДелегирования = ЗамещающиеИПомощники.Ссылка
		|ГДЕ
		|	УчастникиМероприятия.Мероприятие = &Мероприятие
		|
		|УПОРЯДОЧИТЬ ПО
		|	Исполнитель,
		|	ОтКогоДелегирование");
	
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	
	Запрос.УстановитьПараметр("СотрудникиПользователя", Сотрудники.СотрудникиПользователя());
	
	ДоступныеПриглашения = Запрос.Выполнить().Выгрузить();
	
	ДоступныеПриглашения.Колонки.Добавить("Представление");
	
	Для Каждого ДоступноеПриглашение Из ДоступныеПриглашения Цикл
		
		Если Не ЗначениеЗаполнено(ДоступноеПриглашение.ОтКогоДелегирование) Тогда
			ДоступноеПриглашение.Представление = Строка(ДоступноеПриглашение.Исполнитель);
		Иначе
			ДоступноеПриглашение.Представление = СтрШаблон(
				"%1 (%2)",
				Строка(ДоступноеПриглашение.Исполнитель),
				Строка(ДоступноеПриглашение.ОтКогоДелегирование));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДоступныеПриглашения;
	
КонецФункции

// Изменяет состояние приглашения на мероприятие.
//
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия - Мероприятие.
//  Исполнитель - СправочникСсылка.ПолныеРоли,
//                СправочникСсылка.Пользователи,
//                СправочникСсылка.Сотрудники - Исполнитель.
//  СостояниеПриглашения - ПеречислениеСсылка.СостоянияПриглашения - Состояние приглашения.
//  ОтКогоДелегирование - СправочникСсылка.Сотрудники.
//
Процедура ИзменитьСостояниеПриглашения(
	Мероприятие,
	Исполнитель,
	СостояниеПриглашения,
	ОтКогоДелегирование = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Если Не ПривилегированныйРежим() Тогда
			ДоступныеПриглашения = ДоступныеПриглашения(Мероприятие);
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Исполнитель", Исполнитель);
			ПараметрыОтбора.Вставить("ОтКогоДелегирование", ОтКогоДелегирование);
			НайденныеСтроки = ДоступныеПриглашения.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				ПредставлениеУчастника = Строка(Исполнитель);
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Недостаточно прав для изменения состояние приглашения участника %1 на мероприятие %2.'"),
					ПредставлениеУчастника,
					Мероприятие);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		УстановитьСостояниеПриглашения(
			Мероприятие,
			Исполнитель,
			СостояниеПриглашения,
			Неопределено,
			ОтКогоДелегирование,
			Истина);
		
		УправлениеМероприятиями.ОбновитьСостояниеПриглашений(Мероприятие);
		
		Если СостояниеПриглашения = Перечисления.СостоянияПриглашения.Принято Тогда
			
			РаботаСУведомлениями.ОбработатьСобытиеУведомления(
				Мероприятие,
				Перечисления.СобытияУведомлений.МероприятияПринятоПриглашение,
				ПользователиДокументооборот.ОлицетворяемыйПользователь(),
				Новый ХранилищеЗначения(Исполнитель));
			
		ИначеЕсли СостояниеПриглашения = Перечисления.СостоянияПриглашения.НеПринято Тогда
			
			РаботаСУведомлениями.ОбработатьСобытиеУведомления(
				Мероприятие,
				Перечисления.СобытияУведомлений.МероприятияОтклоненоПриглашение,
				ПользователиДокументооборот.ОлицетворяемыйПользователь(),
				Новый ХранилищеЗначения(Исполнитель));
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Проверяет, является ли переданный исполнитель участником мероприятия.
//
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятие - Мероприятие.
//  Исполнитель - СправочникСсылка.Контрагенты,
//                СправочникСсылка.ЛичныеАдресаты,
//                СправочникСсылка.ПолныеРоли,
//                СправочникСсылка.Пользователи,
//                СправочникСсылка.Сотрудники,
//                СправочникСсылка.КонтактныеЛица - Исполнитель.
// 
// Возвращаемое значение:
//  Булево - Исполнитель является участником.
//
Функция ЯвляетсяУчастникомМероприятия(Мероприятие, Исполнитель) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	УчастникиМероприятия.Исполнитель
		|ИЗ
		|	РегистрСведений.УчастникиМероприятия КАК УчастникиМероприятия
		|ГДЕ
		|	УчастникиМероприятия.Мероприятие = &Мероприятие
		|	И УчастникиМероприятия.Исполнитель = &Исполнитель");
	
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	
	ЯвляетсяУчастникомМероприятия = Не Запрос.Выполнить().Пустой();
	
	Возврат ЯвляетсяУчастникомМероприятия;
	
КонецФункции

// Устанавливает состояние приглашения на мероприятие.
//
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия
//  Исполнитель - СправочникСсылка.ПолныеРоли
//              - СправочникСсылка.Пользователи
//              - СправочникСсылка.Сотрудники
//  СостояниеПриглашения - ПеречислениеСсылка.СостоянияПриглашения
//  КонтрольнаяСуммаПриглашения - Строка
//  ОтКогоДелегирование - СправочникСсылка.Сотрудники
//  ОтключитьОповещения - Булево
//  ДополнительныеПараметры - Структура
//                          - Неопределено
//
Процедура УстановитьСостояниеПриглашения(
	Мероприятие,
	Исполнитель,
	СостояниеПриглашения,
	КонтрольнаяСуммаПриглашения = Неопределено,
	ОтКогоДелегирование = Неопределено,
	ОтключитьОповещения = Ложь,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		ЭтоРолевоеПриглашение =
			ТипЗнч(Исполнитель) = Тип("СправочникСсылка.ПолныеРоли") И ЗначениеЗаполнено(ОтКогоДелегирование);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УчастникиМероприятия");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Мероприятие", Мероприятие);
		ЭлементБлокировки.УстановитьЗначение("Исполнитель", Исполнитель);
		Если ЭтоРолевоеПриглашение Тогда
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УчастникиМероприятия");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Мероприятие", Мероприятие);
			ЭлементБлокировки.УстановитьЗначение("Исполнитель", ОтКогоДелегирование);
		КонецЕсли;
		Блокировка.Заблокировать();
		
		ЗначенияКлюча = Новый Структура;
		ЗначенияКлюча.Вставить("Мероприятие", Мероприятие);
		ЗначенияКлюча.Вставить("Исполнитель", Исполнитель);
		КлючЗаписи = СоздатьКлючЗаписи(ЗначенияКлюча);
		ЗаблокироватьДанныеДляРедактирования(КлючЗаписи);
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Мероприятие.Установить(Мероприятие);
		НаборЗаписей.Отбор.Исполнитель.Установить(Исполнитель);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			ПредставлениеУчастника = Строка(Исполнитель);
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Участник %1 мероприятия %2 не найден.'"),
				ПредставлениеУчастника,
				Мероприятие);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.СостояниеПриглашения = СостояниеПриглашения;
			Если КонтрольнаяСуммаПриглашения <> Неопределено Тогда
				Запись.КонтрольнаяСуммаПриглашения = КонтрольнаяСуммаПриглашения;
			КонецЕсли;
			Если ЭтоРолевоеПриглашение Тогда
				Запись.Исполнитель = ОтКогоДелегирование;
			КонецЕсли;
		КонецЦикла;
		Если Не ЭтоРолевоеПриглашение Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьОпределениеЗависимыхПрав", Истина);
			НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьРасширениеРабочейГруппыМероприятия", Истина);
			НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьОбновлениеДанныхМероприятия", Истина);
			НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьАвтообновлениеОбсуждений", Истина);
			Если ДополнительныеПараметры <> Неопределено Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
			КонецЕсли;
			НаборЗаписей.Записать();
		Иначе
			НаборЗаписейРолевой = СоздатьНаборЗаписей();
			НаборЗаписейРолевой.Отбор.Мероприятие.Установить(Мероприятие);
			НаборЗаписейРолевой.Отбор.Исполнитель.Установить(ОтКогоДелегирование);
			Для Каждого Запись Из НаборЗаписей Цикл
				ЗаписьРолевая = НаборЗаписейРолевой.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьРолевая, Запись);
			КонецЦикла;
			// Дополнительные свойства не переносим, чтобы отработала стандартная логика при смене участника.
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			НаборЗаписейРолевой.Записать();
		КонецЕсли;
		
		РаботаСРабочимКалендаремСервер.ОбновитьЗаписиКалендаряПоПредмету(
			Мероприятие,
			ОтключитьОповещения,
			Исполнитель,
			ДополнительныеПараметры);
		Если ЭтоРолевоеПриглашение Тогда
			РаботаСРабочимКалендаремСервер.ОбновитьЗаписиКалендаряПоПредмету(
				Мероприятие,
				ОтключитьОповещения,
				ОтКогоДелегирование,
				ДополнительныеПараметры);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
